/* Global declarations and statements will be wrapped in MAIN */
DECLARE GLOBAL_NUM FIXED;
GLOBAL_NUM = 100;

IF GLOBAL_NUM > 50 THEN
   CALL PROCESS_LARGE_NUMBER;
ELSE
   CALL PROCESS_SMALL_NUMBER;
END;

/* Regular procedures */
PROCESS_LARGE_NUMBER: PROCEDURE;
   DECLARE RESULT FIXED;
   RESULT = GLOBAL_NUM * 2;
END;

PROCESS_SMALL_NUMBER: PROCEDURE;
   DECLARE RESULT FIXED;
   RESULT = GLOBAL_NUM / 2;
END;