CALC: PROCEDURE;
    DECLARE a FIXED = 10;
    DECLARE b FIXED = 20;
    DECLARE sum FIXED;
    DECLARE diff FIXED;
    DECLARE prod FIXED;

    sum = a + b;
    diff = a - b;
    prod = a * b;
END;